Revit 2027 API
IFCLegacyStairOrRamp Properties
The IFCLegacyStairOrRamp type exposes the following members.
Properties
Name | Description
IsRamp |  True if it is a ramp, false if it is a stair.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RiserHeight |  The height of riser.
Top
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace